tap "eth-p/software"
tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Screen recorder and video editor
cask "camtasia"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Virtual globe
cask "google-earth-pro"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Password manager app
cask "keepassxc"
# Interface for reading and syncing eBooks
cask "kindle"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office-businesspro"
# Mind Mapping Tool
cask "mindjet-mindmanager"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader, editor and annotator
cask "pdf-expert"
# VPN client focusing on security
cask "protonvpn"
# Screen capture software
cask "snagit"
# Web browser focusing on security
cask "tor-browser"
# Charting and social-networking for investment traders
cask "tradingview"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Video communication and virtual meeting platform
cask "zoom"
mas "24 Hour Wallpaper", id: 1226087575
